package taskMikhail.taskLesson2;

public class HW {
    public static void getTwoNumbers(int[] arr, int n) {
        int a = 0;
        int b = 0;

        // Дан массив и число n
        // вывести на экран два любых числа из массива которые
        // в сумме дают n за один проход либо написать, что таких чисел нет
        // [0 1 5 4 8 9 3 2 6] n = 13

        // ** выдать все пары чисел

        System.out.println("First number is: " + a);
        System.out.println("Second number is: " + b);
    }

    public boolean isDuplicated(int[] nums) {
        // необходимо проверить массив на наличие повторений чисел
        return false;
    }

    public static int getMinSequence(int[] nums) {
        int minSeq = 0;
        // [1 1 5 4 8 9 2 4 6] n = 11
        // вернуть длину минимальной последовательности
        // которая в сумме дает n
        // в массиве все числа положительные

        return minSeq;
    }
}
